---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.FormFailures.FormElemRegenSelfIntersectionResetConnections
source: html/5be67985-96f3-4dc4-2f97-6ce9f3b61649.htm
---
# Autodesk.Revit.DB.BuiltInFailures.FormFailures.FormElemRegenSelfIntersectionResetConnections Property

This form cannot be created due to self-intersecting geometry. Clicking the Reset Connections button will attempt to solve this problem.

## Syntax (C#)
```csharp
public static FailureDefinitionId FormElemRegenSelfIntersectionResetConnections { get; }
```